backend/performance-tests/performance-monitoring-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm-up phase"
    - duration: 300
      arrivalRate: 10
      name: "Load test phase"
    - duration: 120
      arrivalRate: 20
      name: "High load test phase"
    - duration: 60
      arrivalRate: 5
      name: "Cool-down phase"
  environments:
    development:
      target: 'http://localhost:3000'
    staging:
      target: 'https://staging-api.example.com'
    production:
      target: 'https://api.example.com'
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './performance-test-processor.js'

scenarios:
  - name: "Performance API Test"
    weight: 40
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'admin@test.com'
            password: 'TestPassword123!'
          capture:
            - json: $.token
              as: authToken
      - get:
          url: '/api/performance/health'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - get:
          url: '/api/performance/metrics/current'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - get:
          url: '/api/performance/dashboard'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - think: 2

  - name: "Cache Performance Test"
    weight: 30
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'planner@test.com'
            password: 'TestPassword123!'
          capture:
            - json: $.token
              as: authToken
      - get:
          url: '/api/performance/cache'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - get:
          url: '/api/performance/memory'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - think: 1

  - name: "Memory Usage Test"
    weight: 20
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'admin@test.com'
            password: 'TestPassword123!'
          capture:
            - json: $.token
              as: authToken
      - get:
          url: '/api/performance/response-time'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - get:
          url: '/api/performance/report'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          expect:
            - statusCode: 200
      - think: 3

  - name: "High Frequency Metrics"
    weight: 10
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'admin@test.com'
            password: 'TestPassword123!'
          capture:
            - json: $.token
              as: authToken
      - loop:
          - get:
              url: '/api/performance/metrics/current'
              headers:
                Authorization: 'Bearer {{ authToken }}'
              expect:
                - statusCode: 200
          - think: 0.5
        count: 10